### Pandas

- Pandas is written over numpy. 
- Pandas series is 1D and Dataframe is 2D
- Dataframe is DS used to stoe data in tabular form

In [1]:
import pandas as pd
import numpy as np

In [3]:
#empty series
pd_series= pd.Series()

C:\Users\vidieme\AppData\Local\Temp\ipykernel_28268\2266561420.py:1: FutureWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  pd_series= pd.Series()

In [4]:
pd_series

Series([], dtype: float64)

2. Create series from array

In [7]:
data= np.array(["m","e","l","i"])

pd.Series(data)

0    m
1    e
2    l
3    i
dtype: object

3. Create a series from array with custom index

In [9]:
#index= [10,11,12,13]

ser= pd.Series(data, index= [10,11,12,13])
ser

10    m
11    e
12    l
13    i
dtype: object

4. Create series from list

In [11]:
list1= ["w","i","s","h"]
list2= pd.Series(list1)
list2

0    w
1    i
2    s
3    h
dtype: object

5. Create series from dictionary

In [16]:
dict = {'Geeks': 10,
  'for': 20,
  'geeks': 30}

dict2= pd.Series(dict)
dict2

Geeks    10
for      20
geeks    30
dtype: int64

6. Creating series from scalar value

In [18]:
sca= pd.Series(10, index)
sca

10    10
11    10
12    10
13    10
dtype: int64

7. Create series using range function

In [19]:
pd.Series(range(5))

0    0
1    1
2    2
3    3
4    4
dtype: int64

8. create series from numpy function

In [21]:
ser1 = pd.Series(np.linspace(3, 33, 3))
print(ser1)

0     3.0
1    18.0
2    33.0
dtype: float64

In [23]:
ser2 = pd.Series(np.random.randn(3))
print("\n", ser2)

 0   -1.329086
1   -1.813509
2   -0.163191
dtype: float64

9. create copy of series: deep copy
- use copy() with parameter deep= True

In [24]:
ser.copy(deep=True)

10    m
11    e
12    l
13    i
dtype: object

10. Create shallow copy

In [25]:
ser.copy(deep=False)

10    m
11    e
12    l
13    i
dtype: object

11. creare data frame

In [27]:
print(pd.DataFrame())

Empty DataFrame
Columns: []
Index: []

12. Create Dataframe using list

In [28]:
lst = ['Geeks', 'For', 'Geeks', 'is',
  'portal', 'for', 'Geeks']

In [29]:
print(pd.DataFrame(lst))

        0
0   Geeks
1     For
2   Geeks
3      is
4  portal
5     for
6   Geeks

In [30]:
 data = {'Name':['Tom', 'nick', 'krish', 'jack'], 'Age':[20, 21, 19, 18]}

In [36]:
df=pd.DataFrame(data)
df

    Name  Age
0    Tom   20
1   nick   21
2  krish   19
3   jack   18

In [32]:
#using list of dictionary

lst = [{1: 'Geeks', 2: 'For', 3: 'Geeks'},
  {1: 'Portal', 2: 'for', 3: 'Geeks'}]

In [33]:
print(pd.DataFrame(lst))

        1    2      3
0   Geeks  For  Geeks
1  Portal  for  Geeks

15. read dataframe from csv file

In [ ]:
pandas.read_csv(file_name)

In [ ]:
pandas.read_table(file_name, delimiter)

17. first few rows of df

In [40]:
df.iloc[1:3]# 0th index is not consider. 1st index till 3, where 3rd is excluded

    Name  Age
1   nick   21
2  krish   19

In [43]:
df= pd.read_csv("CardioGoodFitness.csv")
df

,Product,Age,Gender,Education,MaritalStatus,Usage,Fitness,Income,Miles
0,TM195,18,Male,14,Single,3,4,29562,112
1,TM195,19,Male,15,Single,2,3,31836,75
2,TM195,19,Female,14,Partnered,4,3,30699,66
3,TM195,19,Male,12,Single,3,3,32973,85
4,TM195,20,Male,13,Partnered,4,2,35247,47
...,...,...,...,...,...,...,...,...,...
175,TM798,40,Male,21,Single,6,5,83416,200
176,TM798,42,Male,18,Single,5,4,89641,200
177,TM798,45,Male,16,Single,5,5,90886,160
178,TM798,47,Male,18,Partnered,4,5,104581,120
179,TM798,48,Male,18,Partnered,4,5,95508,180

In [45]:
df.iloc[0:3] #from 0th index till 2. 3 is excluded

  Product  Age  Gender  Education MaritalStatus  Usage  Fitness  Income  Miles
0   TM195   18    Male         14        Single      3        4   29562    112
1   TM195   19    Male         15        Single      2        3   31836     75
2   TM195   19  Female         14     Partnered      4        3   30699     66

In [49]:
df.iloc[100:] #from 100 till end

,Product,Age,Gender,Education,MaritalStatus,Usage,Fitness,Income,Miles
100,TM498,25,Female,14,Partnered,5,3,47754,106
101,TM498,25,Male,14,Single,3,3,45480,95
102,TM498,25,Female,14,Single,2,3,43206,64
103,TM498,25,Male,14,Partnered,4,3,45480,170
104,TM498,25,Male,14,Partnered,3,4,43206,106
...,...,...,...,...,...,...,...,...,...
175,TM798,40,Male,21,Single,6,5,83416,200
176,TM798,42,Male,18,Single,5,4,89641,200
177,TM798,45,Male,16,Single,5,5,90886,160
178,TM798,47,Male,18,Partnered,4,5,104581,120
179,TM798,48,Male,18,Partnered,4,5,95508,180

In [50]:
df.Gender

0        Male
1        Male
2      Female
3        Male
4        Male
        ...
175      Male
176      Male
177      Male
178      Male
179      Male
Name: Gender, Length: 180, dtype: object

In [51]:
df["Gender"]

0        Male
1        Male
2      Female
3        Male
4        Male
        ...
175      Male
176      Male
177      Male
178      Male
179      Male
Name: Gender, Length: 180, dtype: object

In [61]:
#rename

df=df.rename(columns= {"gender":sex}), inplace=True)
df.head()

SyntaxError: cannot assign to function call (1796050000.py, line 3)